Autodesk.Revit.DB.Events.FailuresProcessingEventArgs.SetProcessingResult(Autodesk.Revit.DB.FailureProcessingResult)
Sets the result of the failures processing.
Remarks:
Setting this result may not affect the outcome if other observers of the event are invoked after this one.
The most prohibitive result set by all handlers will be used.
result:
The result.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Events.FailuresProcessingEventArgs
The event arguments used by the FailuresProcessing event.
Since:
2011